/*
Node.js основы


Глобальные объекты:
    - в node.js доступа к объекту window у нас нет. Т.к мы работаем вне браузера

Альтернативой node является целый набор глобальных объектов которые помогают расширить базовую логику

Объект global - предоставляет доступ к глобальным, то есть доступным из каждого модуля приложения, переменным и функциям
Объект __dirname - это переменная, которая указывает абсолютный путь к каталогу, содержащему текущий исполняемый файл
Объект __filename - возвращается весь путь до файла, включая его имя и расширение
Объект process.env - 
Объект url - позволяет работать с получаемыми с сервера url адресами








*/