function sumOfMinimums(arr) {
    return 
}
sumOfMinimums([[7, 9, 8, 6, 2], [6, 3, 5, 4, 3], [5, 8, 7, 4, 5]])

/*
1. Нахождение массива. 
    - у вложенных массивов есть индексы: return arr[0][1] - 9
2. Прохождение по массиву и найти наименьшее значение
3. Наимение значения в всех массивах сложить 
 
Идеи:
    1. Сортировка sort - сортирует по первому значению
        - пройтись по массивам, отсортировать, взять значение с индексом 0

    2. filter - 

    3. for (let i = 0; i > arr.length ; i++) {
        for (let j = 0; j < arr[i].lenght; j++) {

        }
    }

    return arr[i].sort()
*/





