/*
'lodash': 1.2.4 
4 - patсh версия. Исправление ошибок, с обратной совместимостью
2 - минорная версия
1 - мажорная версия. Глобальные изменения нарушающие обратную совместимость

Не устанавливать все зависимости подряд. Т.к поддреживать это проблематично и со временем выше шанс что все сломаеться
Если есть необходимость обновить версию зависимости, то нужно будет подгонять код под изменения
Также может привести к конфликту зависимостей

Все есть возможность написать самому, нужно писать самому
Если необходимый функционал писать сложно и долго можно использовать библиотеку - понять для себя




*/